#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.lambda_function.data.external.archive_prepare[0]: Reading...
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=4d8dcb5bc76b080df01faa7097fdf922f4ef8272]
module.lambda_function.data.external.archive_prepare[0]: Read complete after 0s [id=-]
module.lambda_function.local_file.archive_plan[0]: Refreshing state... [id=17322129c166f3d77e4ab6a63ceff1a1c3e9faea]
module.lambda_function.null_resource.archive[0]: Refreshing state... [id=5288659914087683546]
module.lambda_function.data.aws_caller_identity.current: Reading...
module.s3_bucket.data.aws_region.current: Reading...
aws_apigatewayv2_api.api: Refreshing state... [id=1k08gux1jb]
aws_dynamodb_table.profile: Refreshing state... [id=profile]
module.lambda_function.data.aws_region.current: Reading...
module.lambda_function.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_bucket.data.aws_partition.current: Reading...
module.s3_bucket.data.aws_canonical_user_id.this[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.s3_bucket.aws_s3_bucket.this[0]: Refreshing state... [id=image-generate]
module.lambda_function.data.aws_partition.current: Read complete after 0s [id=aws]
module.s3_bucket.data.aws_caller_identity.current: Reading...
module.lambda_function.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.s3_bucket.data.aws_partition.current: Read complete after 0s [id=aws]
module.lambda_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.lambda_function.aws_iam_role.lambda[0]: Refreshing state... [id=imageGenerator-lambda]
module.lambda_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/imageGenerator-lambda]
module.lambda_function.data.aws_caller_identity.current: Read complete after 0s [id=730335392708]
module.s3_bucket.data.aws_caller_identity.current: Read complete after 0s [id=730335392708]
module.s3_bucket.data.aws_canonical_user_id.this[0]: Read complete after 0s [id=7797a1854717fed9d22a1133797392ed0b42e6ceee5ae1b18e9fea2879fdd5ae]
module.lambda_function.data.aws_iam_policy_document.logs[0]: Reading...
module.lambda_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=3589367311]
module.lambda_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::730335392708:policy/imageGenerator-lambda-logs]
aws_cloudwatch_log_group.api_gw: Refreshing state... [id=/aws/api_gw/imageGenerator-API]
aws_apigatewayv2_stage.apigateway: Refreshing state... [id=$default]
module.lambda_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=imageGenerator-lambda-20240404152400024800000001]
module.lambda_function.aws_lambda_function.this[0]: Refreshing state... [id=imageGenerator-lambda]
module.s3_bucket.aws_s3_bucket_public_access_block.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_ownership_controls.this[0]: Refreshing state... [id=image-generate]
module.s3_bucket.aws_s3_bucket_acl.this[0]: Refreshing state... [id=image-generate,private]
aws_apigatewayv2_integration.lambda["index"]: Refreshing state... [id=hikfcm0]
aws_apigatewayv2_integration.lambda["profile-post"]: Refreshing state... [id=4c3o84v]
aws_apigatewayv2_integration.lambda["profile-get"]: Refreshing state... [id=xsiznv2]
aws_apigatewayv2_route.default_route: Refreshing state... [id=jtu7n6n]
aws_apigatewayv2_route.lambda["profile-post"]: Refreshing state... [id=ydnetyu]
aws_apigatewayv2_route.lambda["index"]: Refreshing state... [id=w6q0xw4]
aws_apigatewayv2_route.lambda["profile-get"]: Refreshing state... [id=x1d5lkp]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.lambda_function.aws_lambda_function.this[0] has changed
  ~ resource "aws_lambda_function" "this" {
        id                             = "imageGenerator-lambda"
      ~ last_modified                  = "2024-04-04T15:24:08.941+0000" -> "2024-04-04T17:16:42.734+0000"
        tags                           = {
            "Name" = "terraform-imageGenerator-lambda"
        }
        # (22 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/ef0fd783416d34828006d0c8a574914c9cb6d9fa12d5cb05daae53a9b3470a5b.zip" -> "builds/fcd43c55d1e1db8dfe23154634e46b230d18a8ac1b97698b9b1d1a2540e0548d.zip"
        id                             = "imageGenerator-lambda"
      ~ last_modified                  = "2024-04-04T17:16:42.734+0000" -> (known after apply)
        tags                           = {
            "Name" = "terraform-imageGenerator-lambda"
        }
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + "zip",
                      + "./python/",
                      + null,
                    ],
                ]
              + filename      = "builds/fcd43c55d1e1db8dfe23154634e46b230d18a8ac1b97698b9b1d1a2540e0548d.zip"
              + runtime       = "python3.9"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/fcd43c55d1e1db8dfe23154634e46b230d18a8ac1b97698b9b1d1a2540e0548d.plan.json"
      + id                   = (known after apply)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
      ~ id       = "5288659914087683546" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/ef0fd783416d34828006d0c8a574914c9cb6d9fa12d5cb05daae53a9b3470a5b.zip" -> "builds/fcd43c55d1e1db8dfe23154634e46b230d18a8ac1b97698b9b1d1a2540e0548d.zip"
          ~ "timestamp" = "1712250764216810000" -> "1712252308820319800"
        }
    }

Plan: 2 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rauljrtafur, Action: `pull_request`*